Revit 2015 API
Document.NewExtrusionRoof Method
Creates a new Extrusion Roof.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public ExtrusionRoof NewExtrusionRoof(
	CurveArray profile,
	ReferencePlane refPlane,
	Level level,
	RoofType roofType,
	double extrusionStart,
	double extrusionEnd
)
Visual Basic
Public Function NewExtrusionRoof ( _
	profile As CurveArray, _
	refPlane As ReferencePlane, _
	level As Level, _
	roofType As RoofType, _
	extrusionStart As Double, _
	extrusionEnd As Double _
) As ExtrusionRoof
Visual C++
public:
ExtrusionRoof^ NewExtrusionRoof(
	CurveArray^ profile,
	ReferencePlane^ refPlane,
	Level^ level,
	RoofType^ roofType,
	double extrusionStart,
	double extrusionEnd
)
Parameters
profile
Type: Autodesk.Revit.DB.CurveArray
The profile of the extrusion roof.
refPlane
Type: Autodesk.Revit.DB.ReferencePlane
The work plane for the extrusion roof.
level
Type: Autodesk.Revit.DB.Level
The level of the extrusion roof.
roofType
Type: Autodesk.Revit.DB.RoofType
Type of the extrusion roof.
extrusionStart
Type: System.Double
Start the extrusion.
extrusionEnd
Type: System.Double
End the extrusion.
Remarks
 This method will regenerate the document even in manual regeneration mode.
See Also
Document Class
Autodesk.Revit.Creation Namespace